In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})
df

      data1     data2 key1 key2
0  1.255992 -0.465220    a  one
1 -0.980868 -0.486594    a  two
2 -0.601447 -1.326558    b  one
3 -0.777189  1.693375    b  two
4  0.524105  1.312599    a  one

In [3]:
grouped = df["data1"].groupby(df["key1"])

In [4]:
grouped

In [5]:
grouped.mean()

key1
a    0.266410
b   -0.689318
Name: data1, dtype: float64

In [6]:
means = df["data1"].groupby( [df["key1"], df["key2"]] ).mean()

In [7]:
means

key1  key2
a     one     0.890048
      two    -0.980868
b     one    -0.601447
      two    -0.777189
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a     0.890048 -0.980868
b    -0.601447 -0.777189

In [9]:
df.groupby("key1").mean()

         data1     data2
key1
a     0.266410  0.120261
b    -0.689318  0.183408

In [10]:
df.groupby("key1").count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [11]:
df.groupby(["key1","key2"]).mean()

              data1     data2
key1 key2
a    one   0.890048  0.423689
     two  -0.980868 -0.486594
b    one  -0.601447 -1.326558
     two  -0.777189  1.693375

In [12]:
df.groupby(["key1","key2"])["data2"].mean()

key1  key2
a     one     0.423689
      two    -0.486594
b     one    -1.326558
      two     1.693375
Name: data2, dtype: float64

In [14]:
 df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
df2

               a         b         c         d         e
Joe     2.467141  0.334479  1.993289 -0.289724 -0.047870
Steve  -1.776324 -1.639092  0.146982  1.714914 -0.103814
Wes     0.649854  0.925624 -0.298049 -1.721648  0.015998
Jim     2.146719 -0.413583 -1.809523 -0.464175 -0.202266
Travis  0.040648  2.196618  0.571642 -0.794523 -0.166097

In [15]:
map_dict = {'a':'red', 'b':'red', 'c':'blue', 'd':'orange', 'e':'blue', 'f':'sky'}
map_dict

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'orange', 'e': 'blue', 'f': 'sky'}

In [16]:
df2.groupby(map_dict, axis=1).sum()

            blue    orange       red
Joe     1.945418 -0.289724  2.801621
Steve   0.043169  1.714914 -3.415416
Wes    -0.282051 -1.721648  1.575478
Jim    -2.011789 -0.464175  1.733137
Travis  0.405545 -0.794523  2.237267